# Taps (package repositories)
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "joshmedeski/sesh"
tap "wix/brew"
tap "sst/tap"

# Global configuration for casks
cask_args appdir: "/Applications"

# Development tools
## CLI
brew "git"
brew "azure-cli"
brew "terraform"
brew "lazygit"
brew "lazydocker"

cask "docker-desktop"

brew "fzf"
brew "grep"
brew "wget"
brew "zsh"
brew "yazi"
brew "gum"

# Editors
brew "neovim"
brew "starship"
brew "tmux"
brew "vim"
cask "ghostty"
brew "zsh-autosuggestions"

## Fonts
cask "font-geist-mono"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font" # yazi requirement

# Programming
## Python
brew "uv"

# Productvity
cask "obsidian"
cask "nikitabobko/tap/aerospace"

# Misc
brew "joshmedeski/sesh/sesh" # session manager for tmux
